Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Enabling Maven plugin extensions will register a Quarkus `MavenLifecycleParticipant` which will make sure the Quarkus classloaders used during the build are properly closed. During the `generate-code` and `generate-code-tests` goals the Quarkus application bootstrap is initialized and re-used in the `build` goal (which actually builds and packages a production application). The Quarkus classloaders will be properly closed in the `build` goal of the `quarkus-maven-plugin`. However, if the build fails in between the `generate-code` or `generate-code-tests` and `build` then the Quarkus augmentation classloader won't be properly closed, which may lead to locking of JAR files that happened to be on the classpath on Windows OS.
ja_jp: Mavenプラグインのエクステンションを有効にすると、Quarkus `MavenLifecycleParticipant` が登録され、ビルド中に使用されるQuarkusクラスローダが適切にクローズされるようになります。 `generate-code` と `generate-code-tests` のゴールでは、Quarkusアプリケーションブートストラップが初期化され、 `build` のゴール（本番アプリケーションを実際にビルドしてパッケージ化する）で再利用されます。 `quarkus-maven-plugin` の `build` ゴールでは、Quarkus のクラスローダが適切にクローズされます。しかし、 `generate-code` または `generate-code-tests` と `build` の間でビルドが失敗すると、Quarkus augmentation classloaderは適切に閉じられず、Windows OSのクラスパス上にたまたまあったJARファイルがロックされる可能性があります。

source: Enabling Metrics with MicroProfile Metrics
ja_jp: MicroProfile メトリクスを使用したメトリクスの有効化

source: Enabling Metrics with Micrometer
ja_jp: Micrometer でのメトリクスの有効化

source: Enabling Micrometer metrics
ja_jp: Micrometerメトリクスの有効化

source: Enabling TLS
ja_jp: TLSを有効にする

source: Enabling YAML Configuration
ja_jp: YAML設定の有効化

source: Enabling by default in the Quarkus 3.35 release
ja_jp: Quarkus 3.35 リリースでデフォルトで有効化

source: Enabling full text search capabilities for our classes is as simple as adding a few annotations.
ja_jp: クラスのフルテキスト検索機能の有効化は、アノテーションいくつか追加する場合と同様に、簡単にできます。

source: Enabling full text search capabilities for them is as simple as adding a few annotations.
ja_jp: 全文検索機能を有効にするには、いくつかのアノテーションを追加するだけで簡単です。

source: Enabling gRPC code generation
ja_jp: gRPC コード生成の有効化

source: Enabling metrics collection
ja_jp: メトリクス収集の有効化

source: Enabling persistence
ja_jp: 永続化を有効にする

source: Enabling pretty printing might cause certain processors and JSON parsers to fail.
ja_jp: プリティプリント (pretty printing) を有効にすると、特定のプロセッサーやJSONパーサーで解釈できなくなる可能性があります。

source: Enabling reflection-free Jackson serializers by default
ja_jp: リフレクションなしの Jackson シリアライザーをデフォルトで有効にする

source: Enabling the CORS filter
ja_jp: CORS フィルターの有効化

source: Enabling the cache
ja_jp: キャッシュの有効化

source: Enabling the debug mode
ja_jp: デバッグモードの有効化

source: Enabling the management interface
ja_jp: マネジメントインターフェイスの有効化

source: Enabling trace logs for a particular test only
ja_jp: 特定のテストのみでトレースログを有効にする

source: Enabling transactions
ja_jp: トランザクションの有効化

source: Enclose the ID in double square brackets.
ja_jp: ID を二重の角括弧で囲みます。

source: Encrypt Configuration values
ja_jp: 設定値の暗号化

source: Encrypt session cookie by default, also see the note below
ja_jp: デフォルトでセッション Cookie を暗号化する (以下の注意も参照)

source: Encrypt the claims
ja_jp: クレームの暗号化

source: Encrypted PKCS#8 private key (encrypted with AES-128-CBC)
ja_jp: 暗号化された PKCS#8 秘密鍵 (AES-128-CBC で暗号化)

source: Encryption
ja_jp: 暗号化

source: Encryption algorithm
ja_jp: 暗号化アルゴリズム

source: Encryption at this point requires additional steps to get working.
ja_jp: この時点での暗号化には、作業を開始するための追加のステップが必要です。

source: Encryption key identifier which is checked only when JWK keys are used.
ja_jp: JWK キーを使用する場合にのみチェックされる暗号化キー識別子。

source: Encryption key identifier, checked only when JWK keys are used.
ja_jp: 暗号鍵識別子。JWK キーが使用される場合にのみチェックされます。

source: Encryption secret, with falling back to the client secret and finally a generated secret key
ja_jp: 暗号化シークレット (クライアントシークレット、最終的には生成された秘密鍵へとフォールバック)

source: End User attributes
ja_jp: エンドユーザー属性

source: End session (logout) path
ja_jp: セッション終了 (ログアウト) パス

source: Endpoint
ja_jp: エンドポイント

source: Endpoint managed by Quarkus
ja_jp: Quarkusが管理するエンドポイント

source: Endpoint security annotations and Jakarta REST inheritance
ja_jp: エンドポイントセキュリティーアノテーションと Jakarta REST 継承

source: Endpoints and access policies
ja_jp: エンドポイントとアクセスポリシー

source: Endpoints are managed as CDI beans. By default, the `@Singleton` scope is used. However, developers can specify alternative scopes to fit their specific requirements.
ja_jp: エンドポイントは CDI Bean として管理されます。 デフォルトでは、 `@Singleton` スコープが使用されます。 ただし、開発者は特定の要件に合わせて代替スコープを指定できます。

source: Endpoints generated from the above repositories expose five common REST operations:
ja_jp: 上記のリポジトリから生成されたエンドポイントは、5つの一般的なREST操作を提供します。

source: Endpoints that return a String default to producing text/plain. We plan to do the same for JSON and other types.
ja_jp: String を返すエンドポイントは、デフォルトで text/plain を生成します。JSON やその他の型についても同様のことを行う予定です。

source: Enforce GitHub access token scope in Quarkus OIDC
ja_jp: Quarkus OIDC で GitHub アクセストークンのスコープを強制する

source: Enforce opinionated and sensible defaults based on the close world view of the application (e.g. an application with no `@Entity` does not need to start Hibernate ORM)
ja_jp: アプリケーションの近い世界観に基づいて、定見に基づいた賢明なデフォルトを強制（例えば、 `@Entity` のないアプリケーションは、Hibernate ORM を起動する必要はありません）

source: Enforce security and network policies
ja_jp: セキュリティーおよびネットワークポリシーを適用する

source: Enforcing Singletons
ja_jp: シングルトンの強制

source: Enforcing that a token has been issued by the specific issuer is RECOMMENDED. The token issuer is discovered when the provider supports the discovery, otherwise `quarkus.oidc.token.issuer` can be set to a specific value.
ja_jp: トークンが特定の発行者によって発行されたことを強制することが推奨されます。プロバイダーがディスカバリーをサポートしている場合はトークン発行者が自動検出されますが、そうでない場合は `quarkus.oidc.token.issuer` に特定の値を設定できます。

source: Enforcing that a token is intended for a specific audience is RECOMMENDED. ID tokens are required to have an audience value matching the `quarkus.oidc.client-id` property by default. For bearer access tokens, the audiences are not standardized, for example, they can be URLs representing a target endpoint. When possible, bearer access tokens should also be restricted to have specific audience values.
ja_jp: トークンが特定のオーディエンス向けであることを強制することが推奨されます。ID トークンは、デフォルトで `quarkus.oidc.client-id` プロパティーと一致するオーディエンス値を持つ必要があります。ベアラーアクセストークンの場合、オーディエンスは標準化されておらず、例えばターゲットエンドポイントを表す URL になることもあります。可能な場合は、ベアラーアクセストークンも特定のオーディエンス値を持つように制限する必要があります。

source: Engine
ja_jp: エンジン

source: Engine Configuration
ja_jp: エンジン設定

source: Engine Customization
ja_jp: エンジンのカスタマイズ

source: Enhanced Developer Experience
ja_jp: 強化された開発エクスペリエンス

source: Enhanced Developer Experience icon
ja_jp: 強化された開発エクスペリエンスアイコン

source: Enhanced conversion
ja_jp: 変換の強化

source: Enhanced thread model for RESTEasy Reactive
ja_jp: RESTEasy Reactiveの為の改良スレッドモデル

source: Enhancing the OpenAPI Schema with Filters
ja_jp: フィルターによる OpenAPI スキーマの強化

source: Enjoy!
ja_jp: 楽しんで!

source: Enrichment via QuarkusTest*Callback
ja_jp: QuarkusTest* コールバックによる強化

source: Ensure that a fully resolvable DNS domain name is available that you can use to access your application. You can use this domain name to create a Let's Encrypt account and pass the Let's Encrypt ACME challenges to prove that you own this domain. You can use link:https://ngrok.com/[ngrok] to start experimenting with the Quarkus Let's Encrypt ACME feature; for more information, see the <<lets-encrypt-ngrok,Testing with ngrok>> section below.
ja_jp: アプリケーションにアクセスするために使用できる、完全に解決可能な DNS ドメイン名が利用可能であることを確認します。 このドメイン名は、Let's Encrypt アカウントを作成し、Let's Encrypt ACME チャレンジに成功してこのドメインを所有していることを証明するために使用できます。 link:https://ngrok.com/[ngrok] を使用して Quarkus Let's Encrypt ACME 機能を試すことができます。詳細は、以下の <<lets-encrypt-ngrok,Testing with ngrok>> セクションを参照してください。

source: Ensure that the first sentence explains the value and some benefits of the content in 26 words or less.
ja_jp: 最初のセンテンスで、コンテンツの価値やいくつかのメリットを26文字以内で説明しているようにして下さい。

source: Ensure that the property starts with a forward slash (/) character and the path is relative to the base URI of the current endpoint. For example, if it is set to '/error' and the current request URI is `https://localhost:8080/callback?error=invalid_scope`, then a final redirect is made to `https://localhost:8080/error?error=invalid_scope`.
ja_jp: プロパティーがフォワードスラッシュ (/) 文字で始まり、パスが現在のエンドポイントのベース URI と相対的であることを確認します。 たとえば、これが '/error' に設定され、現在のリクエスト URI が `https://localhost:8080/callback?error=invalid_scope` の場合、最終的に `https://localhost:8080/error?error=invalid_scope` へリダイレクトされます。

source: Ensure that the response contains `count`
ja_jp: レスポンスに `count` が含まれていることを確認

source: Ensure that the value of the `@HttpAuthenticationMechanism` annotation matches the authentication scheme supported by `HttpAuthenticationMechanism`. For example, for `@HttpAuthenticationMechanism("custom")` to work, a custom `io.quarkus.vertx.http.runtime.security.HttpAuthenticationMechanism` implementation must set its authentication scheme to `custom` in its `HttpAuthenticationMechanism#getCredentialTransport` method implementation.
ja_jp: `@HttpAuthenticationMechanism` アノテーションの値が、`HttpAuthenticationMechanism` でサポートされる認証スキームと一致することを確認してください。たとえば、`@HttpAuthenticationMechanism("custom")` が機能するためには、カスタム `io.quarkus.vertx.http.runtime.security.HttpAuthenticationMechanism` の実装で、`HttpAuthenticationMechanism#getCredentialTransport` メソッドの実装において認証スキームを `custom` に設定する必要があります。

source: Ensure that the value of the `auth-mechanism` property matches the authentication scheme supported by `HttpAuthenticationMechanism`, for example, `basic`, `bearer` or `custom`. For example, for the `quarkus.http.auth.permission.custom.auth-mechanism=custom` expression to be effective, a custom `HttpAuthenticationMechanism` implementation must set its authentication scheme to `custom` in its `HttpAuthenticationMechanism#getCredentialTransport` method implementation.
ja_jp: `auth-mechanism` プロパティーの値が、`basic`、`bearer`、`custom` などの `HttpAuthenticationMechanism` でサポートされる認証スキームと一致することを確認してください。たとえば、`quarkus.http.auth.permission.custom.auth-mechanism=custom` という表現が有効であるためには、カスタム `HttpAuthenticationMechanism` の実装で、`HttpAuthenticationMechanism#getCredentialTransport` メソッドの実装において認証スキームを `custom` に設定する必要があります。

source: Ensure that the value of the `auth-mechanism` property matches the authentication scheme supported by `HttpAuthenticationMechanism`, for example, `basic`, `bearer`, or `form`.
ja_jp: `auth-mechanism` プロパティの値が、 `HttpAuthenticationMechanism` がサポートする認証スキーム（例えば、 `basic` 、 `bearer` 、 `form` ）と一致しているようにして下さい。

source: Ensure that we have a `200` response and at least one task created
ja_jp: `200` のレスポンスがあり、少なくとも 1 つのタスクが作成されていることを確認してください

source: Ensure that you review and update the suppression list regularly to ensure that the results are up to date. You can optionally apply a time limit to individual suppressions by adding an expiry attribute, as outlined in the following example:
ja_jp: 抑制リストを定期的に見直し、更新して、結果が最新であるようにして下さい。次の例に示すように、expiry属性を追加することで、個々の抑制に時間制限を適用することも可能です:

source: Ensure that your proxy is configured to strip unexpected `Forwarded` or `X-Forwarded-*` headers from the client request.
ja_jp: クライアントリクエストから予期しない `Forwarded` または `X-Forwarded-*` ヘッダーを取り除くようにプロキシが設定されているようにして下さい。

source: Ensure the <<run-application, application is running>> before generating the JSON Web Token (JWT) for the `TokenSecuredResource` endpoint.
ja_jp: `TokenSecuredResource` エンドポイントの JSON Web Token (JWT) を生成する前に <<run-application, application is running>> であることを確認します。

source: Ensure the following dependency is present if you require the MicroProfile Metrics API:
ja_jp: MicroProfile Metrics API が必要な場合は、次の依存関係が存在することを確認してください。

source: Ensure the following dependency is present in your build file if you require the MicroProfile Metrics API:
ja_jp: MicroProfile Metrics APIを必要とする場合は、ビルドファイルに以下の依存関係が存在することを確認してください。

source: Ensure the project builds without errors, all tests pass, and the application functions as required before deploying to production.
ja_jp: 実稼働環境にデプロイする前に、プロジェクトがエラーなくビルドされ、すべてのテストがパスし、アプリケーションが要求どおりに機能することを確認してください。

source: Ensure there are no blank lines between the document id and title, the attribute include (`include::_attributes.adoc[]`) and the declaration of other document attributes(`:attribute:`).
ja_jp: ドキュメント ID とタイトル、属性 include (`include::_attributes.adoc[]`)、およびその他のドキュメント属性の宣言 (`:attribute:`) の間に空白行がないことを確認します。

source: Ensure there are no line breaks in the header section until after `:categories:` line.
ja_jp: `:categories:` 行の後まではヘッダー部に改行が ないようにして下さい。

source: Ensures the `publicKey.pem` file is included as a resource in the native executable.
ja_jp: `publicKey.pem` ファイルがネイティブ実行可能ファイルのリソースとして含まれていることを確認します。

source: Ensures the names in the `Principal` and `JsonWebToken` match because the `JsonWebToken` represents the current `Principal`.
ja_jp: `JsonWebToken` は現在の `Principal` を表すため、 `Principal` と `JsonWebToken` の名前が一致することを確認します。

source: Ensuring validity of tokens and authentication data
ja_jp: トークンと認証データの有効性の確認

source: Enter 2021. Our goal is not just to get back to status quo, it's to introduce major improvements to our process and make the jump head-first into becoming cloud-native!
ja_jp: 2021年に入り、私たちの目標は、単に現状に戻ることではなく、プロセスを大幅に改善し、クラウド・ネイティブに向けて真っ先にジャンプすることです。

source: Enter Quarkus
ja_jp: Quarkusへ

source: Enter a description and Bundle ID (use your application package name), then press `Continue`:
ja_jp: 説明とバンドル ID を入力 (アプリケーションパッケージ名を使用) し、 `Continue` を押します。

source: Enter a description and a Bundle ID (use your application package name):
ja_jp: 説明とバンドル ID を入力します (アプリケーションパッケージ名を使用します)。

source: Enter a name in the top text area (use 2 different names).
ja_jp: 上部のテキストエリアに名前を入力します(2種類の名前を使用します)。

source: Enter a project description, and press `Next`:
ja_jp: プロジェクトの説明を入力し、 `Next` を押します。

source: Enter a registered user name, user password, a relative service endpoint path, click on `Test Service` and you will see a status code such as `200`, `403`, `401` or `404` printed. If the user name is also set in `quarkus.keycloak.devservices.users` map property containing user names and passwords then you do not have to set a password when testing the service. But note, you do not have to initialize `quarkus.keycloak.devservices.users` to test the service using the password grant.
ja_jp: 登録ユーザー名、ユーザーパスワード、相対サービスエンドポイントパスを入力して `Test Service` をクリックすると、 `200`、 `403`、 `401` または `404` などのステータスコードが出力されます。ユーザー名とパスワードを含む `quarkus.keycloak.devservices.users` マッププロパティーでもユーザー名が設定されている場合は、サービスのテスト時にパスワードを設定する必要はありません。ただし、パスワードグラントを使用してサービスをテストするために、 `quarkus.keycloak.devservices.users` を初期化する必要はないことに注意してください。

source: Enter a registered username, user password, a relative service endpoint path, click on `Test Service` and you will see a status code such as `200`, `403`, `401` or `404` printed. If the username is also set in `quarkus.keycloak.devservices.users` map property containing usernames and passwords then you do not have to set a password when testing the service. But note, you do not have to initialize `quarkus.keycloak.devservices.users` to test the service using the password grant.
ja_jp: 登録ユーザー名、ユーザーパスワード、相対サービスエンドポイントパスを入力して `Test Service` をクリックすると、 `200`、 `403`、 `401` または `404` などのステータスコードが出力されます。ユーザー名とパスワードを含む `quarkus.keycloak.devservices.users` マッププロパティーでもユーザー名が設定されている場合は、サービスのテスト時にパスワードを設定する必要はありません。ただし、パスワードグラントを使用してサービスをテストするために、 `quarkus.keycloak.devservices.users` を初期化する必要はないことに注意してください。

source: Enter a use case, and press `Next`:
ja_jp: ユースケースを入力し、 `Next` を押します。

source: Enter the Quarkus Universe
ja_jp: Quarkus Universeへの参加

source: Enter the book details (valid or invalid)
ja_jp: 書籍の詳細を入力してください(有効または無効)

source: Enter the following command on the Quarkus CLI:
ja_jp: Quarkus CLIで以下のコマンドを入力します：

source: Enter the following command on the {openshift} CLI:
ja_jp: {openshift} CLIで以下のコマンドを入力します:

source: Enter the following into GraphiQL to retrieve the film and hero data.
ja_jp: GraphiQLに以下のように入力して、フィルムとヒーローのデータを取得します。

source: Enter the following into GraphiQL to retrieve two films:
ja_jp: 以下をGraphiQLに入力して、2つの映画を検索します。

source: Enter the following into `GraphiQL` and make a request.
ja_jp: `GraphiQL` に以下の内容を入力してリクエストしてください。

source: Enter the following into `GraphiQL` to insert a `Hero`:
ja_jp: `GraphiQL` に次のように入力すると、 `Hero` が挿入されます。

source: Enter the following into the `GraphQL UI` and make a request.
ja_jp: `GraphQL` UIに以下の内容を入力してリクエストしてください。

source: Enter the following into the `GraphQL UI` to insert a `Hero`:
ja_jp: `GraphQL UI` に次のように入力すると、 `Hero` が挿入されます。

source: Enter the following into the `GraphQL UI` to retrieve the film and hero data.
ja_jp: GraphQLに以下のように入力して、フィルムとヒーローのデータを取得します。

source: Enter the following into the `GraphQL UI` to retrieve two films:
ja_jp: 以下をGraphQLに入力して、2つの映画を検索します。

source: Enter the following query into GraphiQL and hit the `play` button:
ja_jp: 以下のクエリをGraphiQLに入力し、 `play` ボタンを押します。

source: Enter the following query into the GraphQL UI and hit the `play` button:
ja_jp: 以下のクエリをGraphQL UIに入力し、 `play` ボタンを押します。

source: Enter the following query to GraphiQL and press the `play` button:
ja_jp: 以下のクエリをGraphiQLに入力し、 `play` ボタンを押します。

source: Enter the following query to the GraphQL UI and press the `play` button:
ja_jp: 以下のクエリをGraphQL UIに入力し、 `play` ボタンを押します。

source: Enter the service provider (SP) entity ID as `http://localhost:8081/realms/quarkus`, where `http://localhost:8081` is a Keycloak base address and `saml` is a broker alias:
ja_jp: サービスプロバイダー (SP) エンティティー ID を `http://localhost:8081/realms/quarkus` と入力します。ここで、 `http://localhost:8081` は Keycloak ベースアドレスで、 `saml` はブローカーエイリアスです。

source: Enter your `Redirect URIs` (set to `<host>/_renarde/security/oidc-success`) and press `Save changes`:
ja_jp: `Redirect URIs` を入力 (`<host>/_renarde/security/oidc-success` に設定) し、 `Save changes` を押します:

source: Entering a world of extensions
ja_jp: エクステンションの世界へ

source: Enterprise AI Blueprints for Java with Quarkus & LangChain4j
ja_jp: Quarkus & LangChain4jを使用したJava向けエンタープライズAIブループリント

source: Enterprise-Grade AI
ja_jp: エンタープライズグレードAI

source: Enterprise-Grade Security, Governance & Observability
ja_jp: エンタープライズグレードのセキュリティ、ガバナンス、Observability

source: Enterprise-Grade icon
ja_jp: エンタープライズグレードアイコン

source: Entity accessor
ja_jp: エンティティーアクセサー

source: Entity classes are normally required to have a default no-arg constructor, unless they are annotated with `@PropertyStrategy(mutable = false)`, which is the case here.
ja_jp: エンティティークラスには通常、今回のように `@PropertyStrategy(mutable = false)` のアノテーションが付けられている場合を除き、デフォルトの引数なしのコンストラクタが必要です。

source: Entity superclass
ja_jp: エンティティの親クラス

source: Entity superinterface
ja_jp: エンティティの親インターフェース

source: Entry point for Observability DevServices
ja_jp: Observability DevServicesのエントリポイント

source: Entry point for everything gRPC.
ja_jp: gRPCの全てについてのエントリーポイントです。

source: Enum Annotated With `@TemplateEnum`
ja_jp: `@TemplateEnum` でアノテーションされた enum

source: Enum values (config items) are translated to skewed-case (hyphenated) by default. The table below illustrates an enum name and their canonical equivalence:
ja_jp: 列挙型の値(設定項目)は、デフォルトではスキュード・ケース(ハイフン付き)に変換されます。以下の表は、列挙型名とその正規の同等表現を示しています。

source: Enums
ja_jp: 列挙

source: Enums are supported
ja_jp: 列挙型をサポートしています。

source: Environment Variables
ja_jp: 環境変数

source: Environment Variables - `AWS_ACCESS_KEY_ID` and `AWS_SECRET_ACCESS_KEY`
ja_jp: 環境変数 - `AWS_ACCESS_KEY_ID` と `AWS_SECRET_ACCESS_KEY`

source: Environment Variables from System
ja_jp: システムからの環境変数

source: Environment Variables from `.env` file
ja_jp: `.env` ファイルからの環境変数

source: Environment variables
ja_jp: 環境変数

source: Environment variables from ConfigMap
ja_jp: ConfigMapからの環境変数

source: Environment variables from Secret
ja_jp: シークレットからの環境変数

source: Environment variables from fields
ja_jp: フィールドからの環境変数

source: Environment variables from key/value pairs
ja_jp: キー/値のペアからの環境変数

source: Environment variables in the `.env` file are not available via the `System.getenv(String)` API.
ja_jp: `.env` ファイルの環境変数は、 `System.getenv(String)` API を介して利用できません。

source: Environment variables names follow the conversion rules specified by link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/configsources.asciidoc#default-configsources[MicroProfile Config].
ja_jp: 環境変数名は、link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/configsources.asciidoc#default-configsources[MicroProfile Config] の変換ルールに従っています。

source: Environment variables names follow the conversion rules specified by link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/configsources.asciidoc#default-configsources[MicroProfile Config]. Config searches three environment variables for a given property name (e.g. `foo.BAR.baz`):
ja_jp: 環境変数名は、 link:https://github.com/eclipse/microprofile-config/blob/master/spec/src/main/asciidoc/configsources.asciidoc#default-configsources[MicroProfile Config] で指定された変換ルールに従います。 Config は、指定されたプロパティ名に対して 3 つの環境変数を検索します (例: `foo.BAR.baz` )：

source: Epsilon GC is a no-op garbage collector which does not do any memory reclamation. From a Quarkus perspective, some of the most relevant use cases for this garbage collector are extremely short-lived jobs, e.g. serverless functions. To build Quarkus native with epsilon GC, pass the following argument at build time:
ja_jp: Epsilon GCは、メモリの再利用を行わないノーオペ・ガベージコレクタです。Quarkusの観点からは、このガベージコレクタに最も関連するユースケースは、サーバーレス機能などの極めて短命のジョブです。epsilon GCを使用してQuarkusネイティブをビルドするには、ビルド時に次の引数を渡します。

source: Equals Operator: `==`/`eq`/`is`
ja_jp: 等価演算子: `==`/`eq`/`is`

source: Equivalent
ja_jp: 等価表現

source: Equivalent `java.util.logging` (JUL) level name
ja_jp: 相当する `java.util.logging` (JUL) レベル名

source: Equivalent entity type
ja_jp: 同等のエンティティー型

source: Equivalent for the Maven plugin: `mvn io.quarkus:quarkus-maven-plugin:2.3.0.Final:create -Dextensions=smallrye-health -DplatformVersion=999-SNAPSHOT`
ja_jp: 同等のMavenプラグイン: `mvn io.quarkus:quarkus-maven-plugin:2.3.0.Final:create -Dextensions=smallrye-health -DplatformVersion=999-SNAPSHOT`

source: Eric and I set up a link:https://github.com/quarkusio/spring-quarkus-perf-comparison[new repository], moved Eric's benchmark code into there, and refined the automations to push results out past the lab's firewall to link:https://github.com/quarkusio/benchmarks[another repository], acting as a data store. We got numbers, and (after a bit of work with link:https://quarkus.io/extensions/io.quarkiverse.batik/quarkus-batik/[Apache Batik]), pictures! Notice how great Quarkus's throughput is. Quarkus can handle 2.7 times (19255 vs 7238 tps) more transactions per second than Spring Boot, as well as starting 2.3 times (2.919s vs 6.569s) faster, all in half the memory (269 MB instead of 583 MB).
ja_jp: Ericと私は link:https://github.com/quarkusio/spring-quarkus-perf-comparison[新しいリポジトリ] を立ち上げ、Ericのベンチマークコードをそこに移動させ、自動化を改良して、結果をラボのファイアウォールを越えてデータストアとして機能する link:https://github.com/quarkusio/benchmarks[別のリポジトリ] にプッシュするようにしました。私たちは数値を取得し、( link:https://quarkus.io/extensions/io.quarkiverse.batik/quarkus-batik/[Apache Batik] を使用した少しの作業の後) 図も手に入れました！Quarkusのスループットがいかに素晴らしいかに注目してください。Quarkusは、Spring Bootと比較して、1秒あたり2.7倍（19255対7238 tps）多くのトランザクションを処理でき、起動も2.3倍（2.919秒対6.569秒）高速であり、すべて半分のメモリ（583MBではなく269MB）で実現します。

source: Error Handling Strategies
ja_jp: エラー処理ストラテジー

source: Error code
ja_jp: エラーコード

source: Error handling
ja_jp: エラー処理

source: Error handling for the exactly-once processing
ja_jp: exactly-once 処理のエラー処理

source: Error pages
ja_jp: エラーページ

source: Error path
ja_jp: エラーパス

source: Escape all occurences of `${`.
ja_jp: すべての `${` との一致をエスケープします。

source: Escape all occurrences of `${`.
ja_jp: すべての `${` との一致をエスケープします。

source: Escaping the `$` character is required to configure the "space/time" GC collection policy if passing via command line in Bash. Other command line environments might have similar requirements.
ja_jp: Bash でコマンドラインから渡す場合、"space/time" GC collection ポリシーを設定するために `$` 文字をエスケープすることが必要です。他のコマンドライン環境では、同様の要件があるかもしれません。
